# -*- org-export-babel-evaluate: (quote inline-only);  -*-
#+TITLE: Exploring the Ranges Infrastructure

#+OPTIONS: toc:t H:2
#+PROPERTY: session *R:4*
#+PROPERTY: exports both
#+PROPERTY: results output
#+PROPERTY: eval no-export
#+PROPERTY: tangle yes

#+BEGIN_LaTeX
\AtBeginSection[]
{
  \begin{frame}<beamer>{Outline}
    \tableofcontents[currentsection]
  \end{frame}
}
#+END_LaTeX

** Sensitivity
   #+begin_src R
   mean(truth$called)
   #+end_src

   #+RESULTS:
   : [1] 0.8214107

** Specificity
   Determine which calls were true:
   #+begin_src R
     calls$fp <- TRUE
     calls$fp[subset(truth, called)$call] <- FALSE
   #+end_src

   Compute FDR:
   #+begin_src R
     mean(calls$fp)
   #+end_src

   #+RESULTS:
   : [1] 0.1009852

   
** FDR and variable "alt" regions
   * Compute the association between FP status and overlap of an alt
     region:
     #+begin_src R
       calls$inAlt <- calls %over% altRegions
       xtabs(~ inAlt + fp, calls)
     #+end_src

     #+RESULTS:
     :        fp
     : inAlt   FALSE TRUE
     :   FALSE  1402  112
     :   TRUE     58   52

